Revit 2027 API
RebarHostData.GetCoverType Method
 Gets the CoverType associated with a face of the element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarCoverType GetCoverType(
	Reference face
)
Public Function GetCoverType (
	face As Reference
) As RebarCoverType
public:
RebarCoverType^ GetCoverType(
	Reference^ face
)
member GetCoverType :
        face : Reference -> RebarCoverType
Parameters
face Reference
Return Value
RebarCoverType
 The cover associated with the face, if it is an exposed face. If the face is concealed, returns null.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace